GH_IO.Serialization.GH_Archive.WriteToFile(System.String,System.Boolean,System.Boolean)
Writes the current tree to a file.
fileName: Path of file to write to. If the extension is not a recognized Grasshopper extension,
an exception will be thrown.
overwrite: True to overwrite file at specified location.
rememberPath: If True, the MRU path field will be updated to reflect the new path.
tempFolderOverride: If not null and a valid folder path, temp files generated during saving will be placed here.
Returns: True on succes, false if file already exists and overwrite is set to false.
Throws System.MemberAccessException: Thrown if the root of the current archive hasn't been instantiated yet.
Throws System.ArgumentNullException: Thrown if file_name is either null or empty.
Throws System.IO.IOException: Thrown if the file_name doesn't represent a known file extension.

GH_IO.Serialization.GH_Archive.CreateTempFilePath(System.String)
Create a temporary file location.
tempFolderOverride: If specified and existent, this folder will be used instead of the system Temp folder.
extension: File extension, including the period.